const strings = {
  STR_gradeItems: [
    "اول دبستان",
    "دوم دبستان",
    "سوم دبستان",
    "جهارم دبستان",
    "پنجم دبستان",
    "ششم دبستان",
    "هفتم دبیرستان",
    "هشتم دبیرستان",
    "نهم دبیرستان",
    "دهم دبیرستان",
    "یازدهم دبیرستان",
    "دوازدهم دبیرستان",
    "پشت کنکوری"
  ],
  STR_notEntered: "وارد نشده",
  STR_pleaseEnterInfo: "لطفا اطلاعات را وارد کنید.",
  STR_infoEntered: "اطلاعات با موفقیت وارد شد.",
  STR_enterPassword: "لطفا پسوورد را وارد کنید.",
  STR_enterPDE: "لطفا نام کاربری، ایمیل یا موبایل را وارد کنید.",
  STR_noUser: "کاربری با این مشخصات وجود ندارد.",
  STR_incorrectPassword: "پسوورد وارد شده اشتباه است.",
  STR_userCreated: "کاربر ساخته شد.",
  STR_userExists: "نام کاربری، ایمیل یا موبایل در پایگاه داده وجود دارد.",
  STR_displayNameExists: "نام کاربری وجود دارد.",
  STR_emailExists: "ایمیل وجود دارد.",
  STR_phoneNumberExists: "شماره تلفن وجود دارد.",
  STR_infoNotEntered: "اطلاعات وارد نشده است.",

  STR_provinces: [
    "تهران",
    "گیلان",
    "آذربایجان شرقی",
    "خوزستان",
    "فارس",
    "اصفهان",
    "خراسان رضوی",
    "قزوین",
    "سمنان",
    "قم",
    "مرکزی",
    "زنجان",
    "مازندران",
    "گلستان",
    "اردبیل",
    "آذربایجان غربی",
    "همدان",
    "کردستان",
    "کرمانشاه",
    "لرستان",
    "بوشهر",
    "کرمان",
    "هرمزگان",
    "چهارمحال و بختیاری",
    "یزد",
    "سیستان و بلوچستان",
    "ایلام",
    "کهگلویه و بویراحمد",
    "خراسان شمالی",
    "خراسان جنوبی",
    "البرز"
  ],
  STR_invalidEmail: "ایمیل قابل قبول نیست.",
  STR_invalidPassword:
    "پسوورد باید لاتین باشد، بین ۶ تا ۱۰ کاراکتر باشد، و دارای حداقل یک حرف بزرگ، حداقل یک حرف کوچک و یک رقم باشد. ",
  STR_passwordsDontMatch: "رمزهای عبور یکی نیستند.",
  STR_invalidMobile:
    "شماره موبایل باید ایرانسل، رایتل، تالیا یا همراه اول باشد.",
  
  STR_invalidDisplayName: "نام کاربری باید لاتین باشد.",

  STR_credit: "سابقه",
  STR_degree: "مدرک",

  STR_firstName: "نام",
  STR_lastName: "نام خانوادگی",

  STR_grade: "مقطع",
  STR_province: "استان",
  STR_city: "شهر",
  STR_school: "مدرسه",

  STR_invalidPrice: "قیمت باید فقط عدد باشد."
};

export default strings;
